const chalk = require('chalk')
const fs = require('fs')

global.allmenu = (prefix, hituet) => {`
return`*ᴏᴡɴᴇʀ ᴏɴʟʏ* = For Owner
*ɢʀᴏᴜᴘ ᴏɴʟʏ* = For Group
*ғʀᴇᴇ ᴏɴʟʏ* = For Free User
*ᴘʀᴇᴍɪᴜᴍ ᴏɴʟʏ* = For Premium User

*—  ᴏᴡɴᴇʀ ᴍᴇɴᴜ ッ*

┌ ◦ .sᴇʟғ *ᴏᴡɴᴇʀ ᴏɴʟʏ*
│ ◦ .ᴘᴜʙʟɪᴄ *ᴏᴡɴᴇʀ ᴏɴʟʏ*
│ ◦ .ᴊᴏɪɴ *ᴏᴡɴᴇʀ ᴏɴʟʏ*
│ ◦ .ʙᴄᴛᴇxᴛ *ᴏᴡɴᴇʀ ᴏɴʟʏ*
│ ◦ .ʙᴄᴠɪᴅ *ᴏᴡɴᴇʀ ᴏɴʟʏ*
│ ◦ .ᴄʀᴇᴀᴛᴇɢᴄ *ᴏᴡɴᴇʀ ᴏɴʟʏ*
│ ◦ .sᴇᴛᴇxɪғ *ᴏᴡɴᴇʀ ᴏɴʟʏ*
│ ◦ .sᴇᴛᴘᴘʙᴏᴛ *ᴏᴡɴᴇʀ ᴏɴʟʏ*
│ ◦ .ʟᴇᴀᴠᴇɢᴄ *ᴏᴡɴᴇʀ ᴏɴʟʏ*
│ ◦ .sʜᴜᴛᴅᴏᴡɴ *ᴏᴡɴᴇʀ ᴏɴʟʏ*
│ ◦ .ᴀᴅᴅʙʟᴏᴄᴋ *ᴏᴡɴᴇʀ ᴏɴʟʏ*
└ ◦ .ᴜɴʙʟᴏᴄᴋ *ᴏᴡɴᴇʀ ᴏɴʟʏ*

*— ᴅᴀᴛᴀʙᴀsᴇ ᴍᴇɴᴜッ*

┌ ◦ .ᴀᴅᴅᴏᴡɴᴇʀ *ᴏᴡɴᴇʀ ᴏɴʟʏ*
│ ◦ .ᴀᴅᴅᴘʀᴇᴍ *ᴏᴡɴᴇʀ ᴏɴʟʏ*
│ ◦ .ᴀᴅᴅsᴛɪᴄᴋ *ᴏᴡɴᴇʀ ᴏɴʟʏ*
│ ◦ .ᴀᴅᴅᴠɴ *ᴏᴡɴᴇʀ ᴏɴʟʏ*
│ ◦ .ᴀᴅᴅɪᴍɢ *ᴏᴡɴᴇʀ ᴏɴʟʏ*
│ ◦ .ᴀᴅᴅᴠɪᴅ *ᴏᴡɴᴇʀ ᴏɴʟʏ*
│ ◦ .ᴅᴇʟᴏᴡɴᴇʀ *ᴏᴡɴᴇʀ ᴏɴʟʏ*
│ ◦ .ᴅᴇʟᴘʀᴇᴍ *ᴏᴡɴᴇʀ ᴏɴʟʏ*
│ ◦ .ᴅᴇʟsᴛɪᴄᴋ *ᴏᴡɴᴇʀ ᴏɴʟʏ*
│ ◦ .ᴅᴇʟᴠɪᴅ *ᴏᴡɴᴇʀ ᴏɴʟʏ*
│ ◦ .ᴅᴇʟɪᴍɢ *ᴏᴡɴᴇʀ ᴏɴʟʏ*
│ ◦ .ᴅᴇʟᴠɴ *ᴏᴡɴᴇʀ ᴏɴʟʏ*
│ ◦ .ʟɪsᴛᴏᴡɴᴇʀ *ᴏᴡɴᴇʀ ᴏɴʟʏ*
│ ◦ .ʟɪsᴛsᴇᴡᴀ *ᴏᴡɴᴇʀ ᴏɴʟʏ*
│ ◦ .ʟɪsᴛʙᴀɴ *ᴏᴡɴᴇʀ ᴏɴʟʏ*
│ ◦ .ʟɪsᴛᴘᴄ *ᴏᴡɴᴇʀ ᴏɴʟʏ*
│ ◦ .ʟɪsᴛɢᴄ *ᴏᴡɴᴇʀ ᴏɴʟʏ*
└ ◦ .ʟɪsᴛʙʟᴏᴄᴋ *ᴏᴡɴᴇʀ ᴏɴʟʏ*

*— sᴛᴏʀᴀɢᴇ ᴍᴇɴᴜッ*

┌ ◦ .sᴇᴛᴄᴍᴅ *ᴏᴡɴᴇʀ ᴏɴʟʏ*
│ ◦ .ᴀᴅᴅᴍsɢ *ᴏᴡɴᴇʀ ᴏɴʟʏ*
│ ◦ .ʟᴏᴄᴋᴄᴍᴅ *ᴏᴡɴᴇʀ ᴏɴʟʏ*
│ ◦ .ᴅᴇʟᴄᴍᴅ *ᴏᴡɴᴇʀ ᴏɴʟʏ*
│ ◦ .ᴅᴇʟᴍsɢ *ᴏᴡɴᴇʀ ᴏɴʟʏ*
│ ◦ .ɢᴇᴛᴍsɢ *ᴏᴡɴᴇʀ ᴏɴʟʏ*
│ ◦ .ʟɪsᴛᴍsɢ *ᴏᴡɴᴇʀ ᴏɴʟʏ*
└ ◦ .ʟɪsᴛᴄᴍᴅ *ᴏᴡɴᴇʀ ᴏɴʟʏ*

*— ᴅᴏᴡɴʟᴏᴀᴅᴍᴇɴᴜ ッ* 

┌ ◦ .ᴛɪᴋᴛᴏᴋ *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .ᴛɪᴋᴛᴏᴋᴍᴘ𝟹 *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .ʏᴛsᴇᴀʀᴄʜ *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .ᴍᴇᴅɪᴀғɪʀᴇ *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .ɪɴsᴛᴀɢʀᴀᴍ *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .ᴘʟᴀʏ *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .ʏᴛᴍᴘ𝟹 *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .ʏᴛᴍᴘ𝟺 *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .ɢᴏᴏɢʟᴇ *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .sᴘᴏᴛɪғʏ *ғʀᴇᴇ ᴏɴʟʏ*
└ ◦ .ʜᴀᴘᴘʏᴍᴏᴅ *ғʀᴇᴇ ᴏɴʟʏ*

*— ɢʀᴏᴜᴘᴍᴇɴᴜッ*

┌ ◦ .ᴀɴᴛɪʟɪɴᴋ *ɢʀᴏᴜᴘ ᴏɴʟʏ*
│ ◦ .sᴇᴛᴘᴘɢᴄ *ɢʀᴏᴜᴘ ᴏɴʟʏ*
│ ◦ .sᴇᴛɴᴀᴍᴇ *ɢʀᴏᴜᴘ ᴏɴʟʏ*
│ ◦ .sᴇᴛᴅᴇsᴋ *ɢʀᴏᴜᴘ ᴏɴʟʏ*
│ ◦ .ᴏᴘᴇɴᴛɪᴍᴇ *ɢʀᴏᴜᴘ ᴏɴʟʏ*
│ ◦ .ᴄʟᴏsᴇᴛɪᴍᴇ *ɢʀᴏᴜᴘ ᴏɴʟʏ*
│ ◦ .ᴘʀᴏᴍᴏᴛᴇ *ɢʀᴏᴜᴘ ᴏɴʟʏ*
│ ◦ .ᴅᴇᴍᴏᴛᴇ *ɢʀᴏᴜᴘ ᴏɴʟʏ*
│ ◦ .ʜɪᴅᴇᴛᴀɢ *ɢʀᴏᴜᴘ ᴏɴʟʏ*
│ ◦ .ᴛᴀɢᴀʟʟ *ɢʀᴏᴜᴘ ᴏɴʟʏ*
│ ◦ .ᴋɪᴄᴋ *ɢʀᴏᴜᴘ ᴏɴʟʏ*
│ ◦ .ᴀᴅᴅ *ɢʀᴏᴜᴘ ᴏɴʟʏ*
└ ◦ .ʀᴇᴠᴏᴋᴇ *ɢʀᴏᴜᴘ ᴏɴʟʏ*

*—  ᴘᴜsʜ ᴍᴇɴᴜ ッ*  

┌ ◦ .pushcontact *ᴏᴡɴᴇʀ ᴏɴʟʏ*
│ ◦ .pushcontactv2 *ᴏᴡɴᴇʀ ᴏɴʟʏ*
│ ◦ .savecontact *ᴏᴡɴᴇʀ ᴏɴʟʏ*
│ ◦ .pushmember *ᴏᴡɴᴇʀ ᴏɴʟʏ*
│ ◦ .idgc *ᴏᴡɴᴇʀ ᴏɴʟʏ*
└ ◦ .jpm *ᴏᴡɴᴇʀ ᴏɴʟʏ*

 *—  ʙᴜɢ ᴍᴇɴᴜ ッ* 
 
┌ ◦ .sendbug *ᴏᴡɴᴇʀ ᴏɴʟʏ*
└ ◦ .sendbugv2 *ᴏᴡɴᴇʀ ᴏɴʟʏ*

*—  ʙᴀɴɴᴇᴅᴍᴇɴᴜ ッ* 

┌ ◦ .baned1 *ᴏᴡɴᴇʀ ᴏɴʟʏ*
│ ◦ .baned2 *ᴏᴡɴᴇʀ ᴏɴʟʏ*
│ ◦ .baned3 *ᴏᴡɴᴇʀ ᴏɴʟʏ*
│ ◦ .baned4 *ᴏᴡɴᴇʀ ᴏɴʟʏ*
│ ◦ .verify *ᴏᴡɴᴇʀ ᴏɴʟʏ*
└ ◦ .logout *ᴏᴡɴᴇʀ ᴏɴʟʏ*

*—  ᴜɴʙᴀɴɴᴇᴅᴍᴇɴᴜ ッ*   

┌ ◦ .unban1 *ᴏᴡɴᴇʀ ᴏɴʟʏ*
│ ◦ .unban2 *ᴏᴡɴᴇʀ ᴏɴʟʏ*
│ ◦ .unban3 *ᴏᴡɴᴇʀ ᴏɴʟʏ*
│ ◦ .unban4 *ᴏᴡɴᴇʀ ᴏɴʟʏ*
│ ◦ .unban5 *ᴏᴡɴᴇʀ ᴏɴʟʏ*
│ ◦ .unban6 *ᴏᴡɴᴇʀ ᴏɴʟʏ*
└ ◦ .unban7 *ᴏᴡɴᴇʀ ᴏɴʟʏ*

*— ᴏᴛʜᴇʀᴍᴇɴᴜッ*

┌ ◦ .ᴀғᴋ *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .ᴅᴀʀᴋᴊᴏᴋᴇ *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .ᴘɪɴᴛᴇʀᴇsᴛ *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .ᴘɪɴɢ *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .ᴏᴡɴᴇʀ *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .ᴍᴇɴᴜ *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .sᴄʀɪᴘᴛ *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .ᴅᴏɴᴀsɪ *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .ʀᴜɴᴛɪᴍᴇ *ғʀᴇᴇ ᴏɴʟʏ*
└ ◦ .ʀᴇᴘᴏʀᴛ *ғʀᴇᴇ ᴏɴʟʏ*

*— ᴄᴏɴᴠᴇʀᴛᴍᴇɴᴜッ*

┌ ◦ .ᴛᴀᴋᴇ *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .ᴏ̨ᴄ *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .ᴛᴏᴠɴ *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .ᴛᴏɢɪғ *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .ᴛᴏɪᴍɢ *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .ᴛᴏᴍᴘ𝟹 *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .ᴛᴏᴍᴘ𝟺 *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .ᴛᴏᴏɴᴄᴇ *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .ᴛᴏᴀᴜᴅɪᴏ *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .sᴛɪᴄᴋᴇʀ *ғʀᴇᴇ ᴏɴʟʏ*
└ ◦ .ssᴡᴇʙ *ғʀᴇᴇ ᴏɴʟʏ*

*— ᴀɴɪᴍᴇッ*

┌ ◦ .ɢᴇɴsʜɪɴ *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .ᴇʟᴀɪɴᴀ *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .ᴇᴍɪʟɪᴀ *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .ʜɪɴᴀᴛᴀ *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .ᴍᴇɢᴜᴍɪɴ *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .ᴋᴀᴏʀɪ *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .ᴡᴀɪғᴜ *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .ᴄᴏsᴘʟᴀʏ *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .ʟᴏʟɪ *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .sʜɪʙᴏᴜʙᴏᴜ *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .ɴᴇᴋᴏ *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .ɴᴇᴋᴏ𝟸 *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .ɴᴇᴋᴏɴɪᴍᴇ *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .ᴍɪᴋᴜ *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .ʀᴀɴᴅᴏᴍɴɪᴍᴇ *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .ʀᴀɴᴅᴏᴍɴɪᴍᴇ𝟸 *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .ᴀɴɪᴍᴇ *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .sʜɪɴᴀ *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .ᴀɴɪᴍᴇᴡᴀʟʟ *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .ᴛᴏᴜᴋᴀ *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .ᴋᴏᴛᴏʀɪ *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .ɴᴇᴢᴜᴋᴏ *ғʀᴇᴇ ᴏɴʟʏ*
│ ◦ .ᴋᴜʀᴜᴍɪ *ғʀᴇᴇ ᴏɴʟʏ*
└ ◦ .sᴀᴋᴜʀᴀ *ғʀᴇᴇ ᴏɴʟʏ*

*— ᴀɴɪᴍᴇ ɴsғᴡッ*

┌ ◦ .ɢɪғʜᴇɴᴛᴀɪ *ᴘʀᴇᴍɪᴜᴍ ᴏɴʟʏ*
│ ◦ .ɴsғᴡʟᴏʟɪ *ᴘʀᴇᴍɪᴜᴍ ᴏɴʟʏ*
│ ◦ .ɴᴇᴋᴏʜᴇɴᴛᴀɪ *ᴘʀᴇᴍɪᴜᴍ ᴏɴʟʏ*
│ ◦ .ɴᴇᴋᴏʜᴇɴᴛᴀɪ𝟸 *ᴘʀᴇᴍɪᴜᴍ ᴏɴʟʏ*
│ ◦ .ᴢᴇᴛᴛᴀɪ *ᴘʀᴇᴍɪᴜᴍ ᴏɴʟʏ*
│ ◦ .ᴛᴇɴᴛᴀᴄʟᴇs *ᴘʀᴇᴍɪᴜᴍ ᴏɴʟʏ*
│ ◦ .ᴍᴀɴɢᴀ *ᴘʀᴇᴍɪᴜᴍ ᴏɴʟʏ*
│ ◦ .ᴄᴜᴍ *ᴘʀᴇᴍɪᴜᴍ ᴏɴʟʏ*
│ ◦ .ʜᴇɴᴛᴀɪ *ᴘʀᴇᴍɪᴜᴍ ᴏɴʟʏ*
│ ◦ .ʙʟᴏᴡᴊᴏʙ *ᴘʀᴇᴍɪᴜᴍ ᴏɴʟʏ*
│ ◦ .ʜɴᴇᴋᴏ *ᴘʀᴇᴍɪᴜᴍ ᴏɴʟʏ*
│ ◦ .ɢᴀɴɢʙᴀɴɢ *ᴘʀᴇᴍɪᴜᴍ ᴏɴʟʏ*
│ ◦ .ʜᴇɴᴛᴀɪᴠɪᴅ *ᴘʀᴇᴍɪᴜᴍ ᴏɴʟʏ*
│ ◦ .ʙʟᴏᴡᴊᴏʙ *ᴘʀᴇᴍɪᴜᴍ ᴏɴʟʏ*
│ ◦ .ɢɪᴅʜᴇɴᴛᴀɪ *ᴘʀᴇᴍɪᴜᴍ ᴏɴʟʏ*
│ ◦ .ʏᴜʀɪ *ᴘʀᴇᴍɪᴜᴍ ᴏɴʟʏ*
│ ◦ .ᴘᴜssʏ *ᴘʀᴇᴍɪᴜᴍ ᴏɴʟʏ*
│ ◦ .ᴀɴɪᴍᴇsᴘᴀɴᴋ *ᴘʀᴇᴍɪᴜᴍ ᴏɴʟʏ*
│ ◦ .ᴍɪʟғ *ᴘʀᴇᴍɪᴜᴍ ᴏɴʟʏ*
└ ◦ .ɢɪғʙʟᴏᴡᴊᴏʙ *ᴘʀᴇᴍɪᴜᴍ ᴏɴʟʏ*
`}